{
	"version": "https://jsonfeed.org/version/1",
	"title": "Michael Descy",
	"home_page_url": "https://micro.mjdescy.me/",
	"feed_url": "https://micro.mjdescy.me/feed.json",
	"items": [
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/21/to-my-surprise.html",
	      	
			"content_html": "<p>To my surprise, and somewhat to my dismay, I have discovered that Swift Playgrounds on iPad works better than Swift Playgrounds on Xcode. On Xcode, my playgrounds always stop working. That doesn’t happen on iPad.</p>\n",
			"date_published": "2018-06-21T10:17:45-04:00",
			"url": "https://micro.mjdescy.me/2018/06/21/to-my-surprise.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/20/general-electric-dropped.html",
	      	
			"title": "General Electric Dropped from Dow",
			
			"content_html": "<p><a href=\"https://www.nytimes.com/2018/06/19/business/dealbook/general-electric-dow-jones.html\">It’s the end of an era.</a></p>\n\n<blockquote>\n  <p>General Electric, the last original member of the Dow Jones industrial average, was dropped from the blue-chip index late Tuesday and replaced by the Walgreens Boots Alliance drugstore chain.</p>\n</blockquote>\n\n<p>Now, don’t even get me started as to the idiocy of following a price-weighted stock index in the age of computers, but being part of the <a href=\"https://en.wikipedia.org/wiki/Dow_Jones_Industrial_Average\">DJIA</a> is a huge badge of honor that G.E. has now lost.</p>\n\n<blockquote>\n  <p>The decision is a fresh blow to General Electric, which has stumbled badly in recent years. Last fall, John L. Flannery, the company’s new chief executive, warned that the power-generation unit was reeling. G.E. cut its dividend for only the second time since the Great Depression. In January, G.E. surprised investors by taking a big charge and setting aside $15 billion over seven years to pay for obligations held by GE Capital, the company’s financial services unit, mainly on long-term care insurance policies.</p>\n</blockquote>\n\n<p>The recent decline of G.E. has been shocking to me. When I was at business school in Connecticut, G.E. was, rightly, considered a giant of industry and of financial services. Now it appears to be a lumbering giant, a lion in winter. I wonder what it will take to turn the company around.</p>\n",
			"date_published": "2018-06-19T21:51:24-04:00",
			"url": "https://micro.mjdescy.me/2018/06/19/general-electric-dropped.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/19/apple-didnt-kill.html",
	      	
			"title": "Apple Didn't Kill Appkit...",
			
			"content_html": "<p>This <a href=\"http://subfurther.com/blog/2018/06/17/apple-didnt-kill-appkit-millenials-did/\">article</a>, quite rightly, made me feel bad about not pushing through the troubles I had porting SwiftoDo to the Mac—a project I haven’t touched in over a year now.</p>\n\n<blockquote>\n  <p>Is it really that hard to share a codebase between Mac and iOS? I just sent off the “other platforms” chapter of Xcode Treasures, and one of the sections is about creating multi-platform projects. The book shows how to add tvOS to an iOS project from earlier in the book, but the idea is the same regardless of which platforms you support: portion off the code you can into cross-platform frameworks, ideally leaving only platform-specific UI code in each platform’s targets.</p>\n</blockquote>\n\n<p>I modularized a lot of my code to allow it to happen someday, but found out that it would require a lot of work to ramp up my AppKit skills. All the data manipulation code is in a well-contained library. That’s just a small part of the app, though. The features are all in UI code, and porting it to AppKit resembles a 90% rewrite of my app.</p>\n\n<p>If I was doing development professionally, I would have done it. But as a hobbyist, it’s hard to want to dive deep into AppKit when there are a million things to create or fix on iOS, which feels like Apple’s future platform anyway. Maybe I’m lazy, and maybe Apple is going to help me out with UIKit on the Mac twelve months from now.</p>\n",
			"date_published": "2018-06-19T17:02:43-04:00",
			"url": "https://micro.mjdescy.me/2018/06/19/apple-didnt-kill.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/19/173012.html",
	      	
			"content_html": "<p>I have been wrestling all day with an Access query with a ton of parameters that causes a crash when run via VBA, but works fine when run manually, which no one would ever do.</p>\n",
			"date_published": "2018-06-19T13:30:12-04:00",
			"url": "https://micro.mjdescy.me/2018/06/19/173012.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/19/apples-embracing-algorithms.html",
	      	
			"content_html": "<p>Apple’s “<a href=\"https://developer.apple.com/wwdc18/223\">Embracing Algorithms</a>” presentation from WWDC 2018 inspired me to try to write some algorithms for my side projects. I have re-discovered just how hard it can be to write <em>memory-constrained</em> algorithms. Modern processor speed and memory limits have spoiled me.</p>\n",
			"date_published": "2018-06-19T10:32:16-04:00",
			"url": "https://micro.mjdescy.me/2018/06/19/apples-embracing-algorithms.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/18/im-wondering-as.html",
	      	
			"content_html": "<p>I’m wondering, as one of my domain names is set to auto-renew, whether domain names increase or decrease in cost over time. I used to register my domain names for ten year periods, to lock in the price, but now I’m not so sure if it is worth it. Prices seem pretty consistent now.</p>\n",
			"date_published": "2018-06-18T10:29:03-04:00",
			"url": "https://micro.mjdescy.me/2018/06/18/im-wondering-as.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/18/my-work-goal.html",
	      	
			"content_html": "<p>My work goal for the week is to build a system to automate lots of grunt work I will otherwise have to do manually every week this summer. Fun stuff.</p>\n",
			"date_published": "2018-06-18T10:00:23-04:00",
			"url": "https://micro.mjdescy.me/2018/06/18/my-work-goal.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/18/my-app-sales.html",
	      	
			"content_html": "<p>My app sales went way up this weekend, and I have no idea why. 🤷‍♂️</p>\n\n<p><img src=\"http://micro.mjdescy.me/uploads/2018/595c9bfd59.jpg\" width=\"269\" height=\"417\" /></p>\n",
			"date_published": "2018-06-17T22:26:10-04:00",
			"url": "https://micro.mjdescy.me/2018/06/17/my-app-sales.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/17/happy-fathers-day.html",
	      	
			"content_html": "<p>Happy Father’s Day to all the dads out there. 😀</p>\n",
			"date_published": "2018-06-17T09:20:03-04:00",
			"url": "https://micro.mjdescy.me/2018/06/17/happy-fathers-day.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/15/142222.html",
	      	
			"content_html": "<p>Today is a good day for me to catch up on WWDC videos while I build databases for my real job.</p>\n",
			"date_published": "2018-06-15T10:22:22-04:00",
			"url": "https://micro.mjdescy.me/2018/06/15/142222.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/13/apple-gave-me.html",
	      	
			"content_html": "<p>Apple gave me a free, full replacement for my 11-month-old iPad Pro with backlight bleed on one edge. The whole thing took about ten minutes, with no fuss whatsoever. I can’t ask for better service than that.</p>\n",
			"date_published": "2018-06-13T12:34:30-04:00",
			"url": "https://micro.mjdescy.me/2018/06/13/apple-gave-me.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/13/learning-the-core.html",
	      	
			"title": "Learning the Core Data Framework",
			
			"content_html": "<p>Lately I have taken it upon myself to finally teach myself <a href=\"https://developer.apple.com/library/archive/documentation/Cocoa/Conceptual/CoreData/index.html?utm_source=iosstash.io\">Core Data</a>. I had avoided it for years, due to its complexity and because it was <em>too much</em> for my projects. I decided to learn it to challenge myself and to level up a bit as an iOS developer.</p>\n\n<p>Learning it reminds me of learning Objective C and Cocoa years ago. Core Data presents itself as a daunting hierarchy of NS-prefixed classes, with lots of layers and moving parts, but it (kind of) makes sense after a long period of study. It’s starting to make sense to me now, though I have barely scratched the surface of its functionality.</p>\n\n<p>I’ve been writing and rewriting and never finishing the same sample app for the past week. Of course, I made it difficult for myself by requiring it to have an App Group, and for the Core Data stack to be defined in its own Framework. I figured out how to do so a couple days ago, and then, this morning, stumbled on the exact same process recommended in <a href=\"https://developer.apple.com/videos/play/wwdc2018/224\">Apple’s WWDC 2018 Core Data Best Practices video </a>. At least I know I got part of my Core Data stack set up the right way!</p>\n",
			"date_published": "2018-06-12T23:45:45-04:00",
			"url": "https://micro.mjdescy.me/2018/06/12/learning-the-core.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/12/apple-hardware-woes.html",
	      	
			"title": "Apple hardware woes",
			
			"content_html": "<p>As much as I love Apple hardware, I’ve got a bunch of Apple hardware problems all of the sudden:</p>\n\n<ul>\n  <li>AirPod battery life has dropped to less than an hour for phone calls. My AirPods are about 18 months old.</li>\n  <li>Bad backlight bleed developed on the bottom edge of my iPad Pro. Dark backgrounds obscure it, but light backgrounds don’t. I will see tomorrow if they will fix it under warranty. My iPad Pro is 11 months old.</li>\n  <li>A bright spot developed in the bottom right corner of my iPhone 7 Plus. You can only see it when that section of the screen is displaying white. I’ll ask about it at the Genius Bar tomorrow. My iPhone is almost 20 months old. Luckily, it’s still covered by AppleCare+.</li>\n  <li>My 2013 MacBook Pro started dropping my USB trackball upon or after going to sleep. I have to unplug and replug it to make it work again. Research has shown me that this sort of thing is one of those unknown bugs. I hope it doesn’t mean my logic board is going.</li>\n</ul>\n\n<p>These are all minor quibbles, but they are all about rather expensive hardware. I think I’m going to start buying AppleCare+ from now on.</p>\n",
			"date_published": "2018-06-12T17:08:31-04:00",
			"url": "https://micro.mjdescy.me/2018/06/12/apple-hardware-woes.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/12/blog-post-a.html",
	      	
			"content_html": "<p>Blog post: <a href=\"https://mjdescy.me/2018/06/11/a-hardware-keyboard-shortcuts-tip-for-drafts-5/\">A Hardware Keyboard Shortcuts Tip for Drafts 5</a></p>\n",
			"date_published": "2018-06-11T23:13:54-04:00",
			"url": "https://micro.mjdescy.me/2018/06/11/blog-post-a.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/12/011117.html",
	      	
			"content_html": "<p>I’m not sure what to make of anything in the news these days. I’m going to pay attention to something that makes sense—like “Westworld”—for the next hour or so.</p>\n",
			"date_published": "2018-06-11T21:11:17-04:00",
			"url": "https://micro.mjdescy.me/2018/06/11/011117.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/09/ive-been-sick.html",
	      	
			"content_html": "<p>I’ve been sick in bed with a cold most of the day, which has scuttled my family’s weekend plans. Why can’t I ever get sick on a weekday?</p>\n",
			"date_published": "2018-06-09T14:10:04-04:00",
			"url": "https://micro.mjdescy.me/2018/06/09/ive-been-sick.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/08/034454.html",
	      	
			"content_html": "<p>Today was a great day. My daughter had a school concert that we all attended, my work day was light (meetings were canceled, even) and later on we all went out for a great fish dinner.</p>\n",
			"date_published": "2018-06-07T23:44:54-04:00",
			"url": "https://micro.mjdescy.me/2018/06/07/034454.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/07/i-finally-figured.html",
	      	
			"content_html": "<p>I finally figured out how to point micro.mjdescy.me to mjdescy.micro.blog. I didn’t realize that I had to set the CNAME record using my web hosting provider’s cPanel rather than through my domain registrar.</p>\n",
			"date_published": "2018-06-07T00:42:04-04:00",
			"url": "https://micro.mjdescy.me/2018/06/07/i-finally-figured.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/07/blog-post-what.html",
	      	
			"content_html": "<p>Blog post: <a href=\"https://mjdescy.me/2018/06/06/what-would-make-me-upgrade-my-series-1-apple-watch/\">What would make me upgrade my Series 1 Apple Watch</a></p>\n",
			"date_published": "2018-06-06T23:04:12-04:00",
			"url": "https://micro.mjdescy.me/2018/06/06/blog-post-what.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/06/edit-for-ios.html",
	      	
			"title": "Edit for iOS",
			
			"content_html": "<p><a href=\"https://audaciousfox.net/projects/edit\">Edit for iOS</a> is the second ultra-simple text editor for iOS—that I have noticed—that has been released this year. I was working on something like this last summer, but for TaskPaper, but abandoned it due to running into some snags, and needing to tend to SwiftoDo again. I think that the iOS share extension, and the increasing complexity of Drafts, has opened a little niche for iOS scratchpad text editors once again. Maybe I will dust of my little project sometime.</p>\n",
			"date_published": "2018-06-06T14:37:47-04:00",
			"url": "https://micro.mjdescy.me/2018/06/06/edit-for-ios.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/06/i-wrote-a.html",
	      	
			"content_html": "<p>I wrote a <a href=\"https://gist.github.com/mjdescy/a805b5b4c49ed79fb240d3886815d5a2\">semantic version number struct in Swift 4.1</a> that someone might find useful.</p>\n",
			"date_published": "2018-06-06T13:50:41-04:00",
			"url": "https://micro.mjdescy.me/2018/06/06/i-wrote-a.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/06/171423.html",
	      	
			"content_html": "<p>It looks like my career path is taking a slight turn once again. Hopefully that means good things are ahead of me.</p>\n",
			"date_published": "2018-06-06T13:14:23-04:00",
			"url": "https://micro.mjdescy.me/2018/06/06/171423.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/05/macbook-pro-forever.html",
	      	
			"title": "MacBook Pro 2013 Forever?",
			
			"content_html": "<p>Reviewing <a href=\"https://512pixels.net/2018/06/macos-10-14-mojave-system-requirements/\">macOS 10.14 Mojave System Requirements</a> makes me think I <em>may</em> only have one year of useful life left on my 2013 MacBook Pro. (Mid 2012 MacBook Pros are the oldest supported.)</p>\n\n<p>If that’s true, it will be disappointing to me, because my laptop still feels fast and has plenty of computing resources. As a developer, I need to keep abreast of the current OS changes though, so I will have to upgrade when OS support is dropped.</p>\n",
			"date_published": "2018-06-05T12:29:28-04:00",
			"url": "https://micro.mjdescy.me/2018/06/05/macbook-pro-forever.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/05/i-thought-i.html",
	      	
			"content_html": "<p>I thought I understood the delegate pattern many years ago, but I keep finding more and more uses for it. If only it applied to real life.</p>\n",
			"date_published": "2018-06-05T00:45:23-04:00",
			"url": "https://micro.mjdescy.me/2018/06/05/i-thought-i.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/06/04/the-transformational-siri.html",
	      	
			"content_html": "<p>The transformational Siri enhancements developers and pundits were hungry for were not announced at WWDC today. Apple is <em>doomed</em>! (OK, maybe not.)</p>\n",
			"date_published": "2018-06-04T15:12:43-04:00",
			"url": "https://micro.mjdescy.me/2018/06/04/the-transformational-siri.html"
		}
		
	]
}
