{
	"version": "https://jsonfeed.org/version/1",
	"title": "Michael Descy",
	"home_page_url": "https://mjdescy.micro.blog/",
	"feed_url": "https://mjdescy.micro.blog/feed.json",
	"items": [
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/08/trying-to-get.html",
	      	
			"title": "Trying to get back into Pinboard, or, maybe I am over-complicating things",
			
			"content_html": "<p>I am trying to get back into <a href=\"https://pinboard.in\">Pinboard</a>, the reliable and, a few years ago, faddish, “antisocial” bookmarking service.</p>\n\n<p>I had been using it as an archive of my old browser bookmarks, and as a “read it later” service to push articles to from Twitter and my RSS reader. I used to use it pretty consistently, with the help of an iOS app and a Chrome plugin for my Mac. When I went on an RSS and Twitter diet late last year, though, I kicked my Pinboard app off my phone as well. More recently, I wiped my Mac clean and reinstalled a bare minimum of apps and services, which did not include Chrome or the whatever Pinboard plugin I had been using with Safari. Since then, Safari and Google have been my bookmarking service, in that I don’t actually save any bookmarks, but rely on typing URLs or searches directly into the browser address bar most of the time.</p>\n\n<p>Recently, in part because iOS supports it in the long-press menu on every URL, I have been saving links to Apple’s built-in Safari Reading List. Saving bookmarks is as low-friction as can be, but reading them is, paradoxically, very high friction for me. I never think to dig into the second panel within Safari’s bookmarks to look for something to read. Consequently, my Safari Reading List has become a graveyard for links that I (think I) want to read but probably never will. Maybe that’s what is is actually for, and maybe that’s what I actually need.</p>\n\n<p>For fun, though, I’m going to try to use Pinboard more instead.</p>\n\n",
			"date_published": "2018-05-08T10:44:53-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/08/trying-to-get.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/08/micro-monday-follow.html",
	      	
			"content_html": "<p>Micro Monday: Follow <a href=\"https://micro.blog/matigo\">@matigo</a>. He’s a lot like me, but lives halfway across the world (in Japan as opposed to New Jersey). He posts and replies to posts frequently, and is a great member of the Micro.blog community.</p>\n",
			"date_published": "2018-05-08T00:04:36-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/08/micro-monday-follow.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/08/robocalls-flooding-your.html",
	      	
			"title": "Robocalls Flooding Your Cellphone? Here’s How to Stop Them",
			
			"content_html": "<p><a href=\"https://nyti.ms/2q5d7oj\">This article</a> inspired me to install <a href=\"https://gethiya.app.link/phone-guard\">Hiya</a> on my iPhone to block spam calls. I will find out eventually how well it works. I get 5-10 robocalls per week, mostly from the same exchange as my mobile number or my Google Voice number.</p>\n\n<p>It seems to rely on a central service for all blocking rules, including an optional whitelist for your contacts and an optional rule based on your phone number for “neighbor” spam. It can identify and block a gigantic list of known spammers and robocallers, which is beyond what I need.</p>\n\n<p>Having looked at it, and its competition, it seems like there isn’t a good on-device-only call blocker for the super-privacy conscious who, like me, only want to whitelist contacts and blacklist all other numbers in a couple of area codes and exchanges. I really want to write one. It would have to be free, I think, based on the free competition out there—but it may fit a particular niche that is out there.</p>\n",
			"date_published": "2018-05-07T20:09:55-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/07/robocalls-flooding-your.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/07/google-plus-still.html",
	      	
			"title": "Google Plus still exists. Why?",
			
			"content_html": "<p>I haven’t thought about this in a long time, but I am actually surprised that <a href=\"https://plus.google.com\">Google Plus</a> still exists. Considering how many products Google launches and kills each year for practically no reason, it’s astounding that one of its monumental flops has been allowed to limp along for so many years. I think it must still be around because either it still generates signals for Google (how many though, compared to other things?), or because it was tied in, at a technical level, to more valuable and integral services like Gmail. All I know is that its continued presence in the Google portfolio serves as yet another reminder to me about how unfocused Google is as an organization.</p>\n",
			"date_published": "2018-05-06T21:10:09-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/06/google-plus-still.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/06/im-making-bean.html",
	      	
			"content_html": "<p>I’m making 12-bean soup today, in an effort to get back to eating home-cooked, wholesome foods. Every few months, as work and family commitments change, my family gets off track. Hopefully we can right the ship now that is is spring.</p>\n\n<p><img src=\"http://mjdescy.micro.blog/uploads/2018/e977b23e44.jpg\" width=\"600\" height=\"600\" /></p>\n",
			"date_published": "2018-05-06T11:12:49-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/06/im-making-bean.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/05/my-th-post.html",
	      	
			"title": "My 300th post on Micro.blog",
			
			"content_html": "<p>According to my Account page, this is my 300th post on Micro.blog. I thought I would share some stats:</p>\n\n<ul>\n  <li>Micro.blog posts: 300</li>\n  <li>Days on the platform: 136 (joined 2017-12-19)</li>\n  <li>Average posts per day: 2.2</li>\n  <li>How many people I follow: 131</li>\n  <li>How many people follow me: I have no idea, and that is fine</li>\n  <li>How much engagement I get from other users: a pleasingly good amount</li>\n  <li>How much I happily paid Manton for Micro.blog hosting thus far: $30 USD ($5/month, not including the free trial period)</li>\n  <li>How little I could have paid, if I wanted: $0 for a WordPress.com blog or $1/month for an inexpensive WordPress host, plus the free Micro.blog account</li>\n</ul>\n\n<p>Micro.blog has gotten me into blogging again after a long time away from it. I enjoy owning my own content, the focus on <em>writing</em> rather than liking or retweeting, and, most of all, the lack of <em>friction</em> in the platform.  Posting short or long form content is as simple as can be, and I don’t have a WordPress install and/or server to maintain.</p>\n\n<p>I am having fun on the platform and look forward to continuing to do so.</p>\n",
			"date_published": "2018-05-04T21:17:27-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/04/my-th-post.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/05/google-news-is.html",
	      	
			"title": "Google News is getting more video",
			
			"content_html": "<p><a href=\"https://www.theverge.com/2018/5/4/17320190/google-news-update-video-youtube-amp\">Google News is getting a revamp with more video and faster load times - The Verge</a></p>\n\n<blockquote>\n  <p>Google is giving Google News a redesign that will bring in elements from its Newsstand app and YouTube, according to sources who spoke with AdAge.</p>\n</blockquote>\n\n<p>More video? Gee, no thanks! Maybe I should give Apple News a try again…</p>\n",
			"date_published": "2018-05-04T20:26:48-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/04/google-news-is.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/04/groundhog-day-the.html",
	      	
			"title": "🎵 Groundhog Day the Musical",
			
			"content_html": "<p><em><a href=\"https://itunes.apple.com/us/album/groundhog-day-musical-original-broadway-cast-recording/1215389487\">Groundhog Day</a></em> is my second favorite Broadway musical of last year (closely behind “Dear Evan Hansen”, which has more plot-related problems but really terrific music), and the only one I saw. I revisit the cast album from time to time, because it is terrific, and multiple listens reveal hidden depth in the earthy lyrics.</p>\n\n<p><a href=\"https://www.broadwayworld.com/article/BWW-CD-Review-GROUNDHOG-DAY-THE-MUSICAL-Original-Broadway-Cast-Recording-is-Charmingly-Animated-20170516\">Broadway World’s review of the cast album</a> is remarkably spot on.</p>\n\n<blockquote>\n  <p>On first listen, Minchin’s melodies are captivating. They are undeniably more poppy than his dark, moody, and undulating score for MATILDA; however, it’s obvious that he has written each of these compositions with the same consideration and care that he did with MATILDA. Despite the more simplistic sounding and pop aural soundscape, the melodies are intricately layered showing an artistry and skill that is not apparent in one listening.</p>\n</blockquote>\n\n<p>I hope Tim Minchin keeps writing musicals. His music and lyrics for his prior show, <em>Matilda</em>, are a masterpiece. (Listen to the London cast recording over the Broadway one if you can; it is a <em>far</em> better performance, though it is missing some of Matilda’s monologues.) “Groundhog Day” doesn’t quite rank as a masterpiece in my book, but it is really, really good.</p>\n\n",
			"date_published": "2018-05-04T19:35:30-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/04/groundhog-day-the.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/04/listening-to-podcasts.html",
	      	
			"title": "Listening to Podcasts without Voice Boost",
			
			"content_html": "<p>I am <em>so</em> accustomed to listening to Podcasts with <a href=\"https://overcast.fm\">Overcast</a>’s “Voice Boost” feature that, when I turn it off (as I’m doing today, because my Bluetooth headphones are too loud) my podcasts sound flat and lifeless.</p>\n\n<p>I wonder, though, why more podcast producers don’t run their episodes through dynamic compression and EQ filters (“Voice Boost”) prior to publishing. For that matter, why don’t they “shorten silences” on their end, too? That way, everyone could benefit from better audio quality and a shorter runtime. I suspect that some of big, radio-show-based podcasts do, but it’s obvious that most other podcasts don’t.</p>\n",
			"date_published": "2018-05-04T09:14:54-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/04/listening-to-podcasts.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/04/the-panic-report.html",
	      	
			"title": "The 2017 Panic Report",
			
			"content_html": "<p>The annual <a href=\"https://panic.com/blog/the-2017-panic-report/\">Panic Report</a> is always worth a read. I use a lot of their apps, and have long considered them an app studio so talented that I will buy whatever they make, so long as I can sometimes use it. They are refreshingly open and honest about their business, too. Their annual reports are especially eye opening if you are a developer and are curious about the business aspects of the App Store.</p>\n\n<p>I thought this part, toward the end, was kind of funny.</p>\n\n<blockquote>\n  <p>⑨ I’m using Transmit 5 as my primary interface to Dropbox. Am I a bad person? —Kyle</p>\n\n  <p>Absolutely not. This is so potentially powerful, we even made a video about it!</p>\n</blockquote>\n\n<p>I don’t install Dropbox on my Mac anymore. Instead, I now use iCloud Drive for cross-device sync. I use Transmit 5 to get to Dropbox, the few times I need it. It seems weird to do so at first, but it is much lighter on resources, if you don’t need file sync.</p>\n",
			"date_published": "2018-05-03T23:40:14-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/03/the-panic-report.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/04/note-to-past.html",
	      	
			"content_html": "<p>Note to past self:</p>\n\n<p>Remind me again why you decided to rewrite, yet again, the Dropbox-related code in your app? You know, the code that you may just get rid of completely a few months from now?</p>\n\n<p>Sincerely,\n🤯</p>\n",
			"date_published": "2018-05-03T20:59:30-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/03/note-to-past.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/02/i-didnt-know.html",
	      	
			"content_html": "<p>I didn’t know about this action to post <em>directly</em> from Drafts 5 to micro.blog, with or without a title, until today. It’s a game-changer for me.</p>\n\n<p><a href=\"https://actions.getdrafts.com/a/1Hg\">Post to Micro.blog (with Title) - Drafts Action Directory</a></p>\n",
			"date_published": "2018-05-02T16:50:02-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/02/i-didnt-know.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/02/two-of-the.html",
	      	
			"title": "Two of the best platformers I've played on iOS are getting their due today from Apple",
			
			"content_html": "<p>Today, Apple’s US App Store is highlighting two great games that are among the best on the platform:</p>\n\n<ul>\n  <li><a href=\"https://itunes.apple.com/us/story/id1356375657\">Game of the Day: Goblin Sword</a>. Goblin Sword plays like a AAA title from the 16-bit days, and has great play control, difficulty, and variety. It’s fantastic.</li>\n  <li><a href=\"https://itunes.apple.com/us/story/id1369365671\">Games Are Art: The Beauty of Oddmar</a>. I learned about Oddmar from someone else on micro.blog, and have only played through a handful of levels. The play controls are unique and well suited for the iPhone, and the graphics and sound are amazing. It’s a fun and funny game.</li>\n</ul>\n",
			"date_published": "2018-05-02T14:07:59-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/02/two-of-the.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/02/remote-login-inception.html",
	      	
			"title": "Remote login Inception",
			
			"content_html": "<p>At work, our clients are far more interested in information security than they used to be. That’s great, and I applaud them for it. Of course, as a user of their systems, there is a trade-off in terms of convenience.</p>\n\n<p>Lately, logging into remote systems seems like entering a-dream-within-a-dream-within-a-dream—a la <em><a href=\"https://www.imdb.com/title/tt1375666/\">Inception</a></em>. Instead of merely using Remote Desktop to log into systems with a single username/password, we now follow in-depth login procedures using virtualization software, RSA tokens that generate unique, one-time passwords, Remote Desktop logins, and systems logins.</p>\n",
			"date_published": "2018-05-02T11:26:56-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/02/remote-login-inception.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/02/who-cares-about.html",
	      	
			"title": "Who cares about Apple earnings reports?",
			
			"content_html": "<p>Do Windows fans care about Microsoft’s earnings? Do Android fans care about Google’s? I wonder if the main reason Apple fans (non-investors) <a href=\"https://sixcolors.com/post/2018/05/apple-quarterly-results-charts-live-tweets/\">cheer on Apple’s good earnings reports</a> is that Apple almost went out of business in the 1990s. Unless the company is going out of business, or if you have tied a lot of your money up with them somehow, who cares about its quarterly earnings report?</p>\n",
			"date_published": "2018-05-01T22:59:11-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/01/who-cares-about.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/01/201333.html",
	      	
			"title": "📚 Ready Player One, by Ernest Cline",
			
			"content_html": "<p>Earlier this year, I completed reading <em><a href=\"https://en.m.wikipedia.org/wiki/Ready_Player_One\">Ready Player One</a></em> by Ernest Cline. It was the first novel that I had read in a while, as I have been reading mostly nonfiction in recent years. I discovered the book from an <a href=\"https://twit.tv/shows/triangulation/episodes/322\">episode of the “Triangulation” podcast in which Leo Laporte interviewed author Andy Weir</a>, who enthusiastically recommended the book.</p>\n\n<p>Overall, I enjoyed the book. The prose is efficient and the pacing is swift. I thought it started out strong, and I liked the world building and the build-up of suspense in the early chapters. After a while, though, I tired of all the 1980s video game and movie references, and wanted the book to end. While I was about three quarters through the book, I referred to it as “the reading equivalent to watching somebody else play video games”. For me, the stakes felt too low, and the characterizations were too thin, to make a lasting impression. Still, I had fun reading it, at least most of the way through.</p>\n",
			"date_published": "2018-05-01T16:13:33-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/01/201333.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/01/the-best-part.html",
	      	
			"content_html": "<p>The best part of working from home is the ability to take a nice walk after lunch. Spring weather was finally here at lunchtime, and I thoroughly enjoyed it. Summer temperatures will follow by dinner time and last for the foreseeable future. So, that was spring!</p>\n\n<p><img src=\"http://mjdescy.micro.blog/uploads/2018/0efce021cd.jpg\" width=\"600\" height=\"599\" /></p>\n",
			"date_published": "2018-05-01T14:27:03-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/01/the-best-part.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/01/i-quit-my.html",
	      	
			"title": "I quit my iPhone for a basic Nokia and it was hard but worth it",
			
			"content_html": "<p><a href=\"https://qz.com/1264704/at-first-life-without-a-smartphone-was-terrifying-then-it-was-beautiful/\">This article on Quartz about limiting smartphone use</a> is both sublime and ridiculous.</p>\n\n<blockquote>\n  <p>I want to be present. Is that so much to ask for? Is that so odd to crave in this day and age?</p>\n\n  <p>Maybe you’re reading this thinking I’m taking it too far and being ridiculous. That it’s just a smartphone, people check them all the time and that’s just the way it is and I should get over it and get used to it. But being on it most of my free time feels wrong on every level. I don’t want to get used to it anymore. It shouldn’t be this hard to reduce the amount of time I spend looking at this damn screen instead of being with my own thoughts. It shouldn’t be this challenging. But it is. And that says tons.</p>\n</blockquote>\n\n<p>A few years ago I wanted to do the same thing this author does—downgrade from smartphone to dumbphone—but to save money rather than to improve my contact with the outside world. My plan was to replace the smartphone with an iPad Mini, which I would use only on WiFi. Back then I shuttled every article I read from my RSS app (Reeder) to my read-it-later app (Pocket) and cached them offline, so I would rarely be without an offline time waster, to fill in those dull times in waiting rooms or on trains. I didn’t go through with the plan, though. I got caught up in smartphone fever along with everyone else in my office. It was an exciting time in the development of that technology—much more exciting than today.</p>\n\n<p>I think it is interesting and admirable to try to limit your smartphone use, and it is fun to read about someone’s experience with it. I <em>also</em> think that this essay is the sort of thing my grandchildren will read in history class, perhaps on the whatever slab of glass and silicon they carry, and laugh at how silly we were to distrust the most transformative technology of our time.</p>\n",
			"date_published": "2018-05-01T09:41:46-04:00",
			"url": "https://mjdescy.micro.blog/2018/05/01/i-quit-my.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/05/01/blog-post-premature.html",
	      	
			"content_html": "<p>Blog post: <a href=\"https://mjdescy.me/2018/04/30/premature-optimization/\">Premature Optimization</a></p>\n",
			"date_published": "2018-04-30T23:15:43-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/30/blog-post-premature.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/30/introducing-the-new.html",
	      	
			"title": "Introducing The New Yorker Crossword Puzzle",
			
			"content_html": "<p><a href=\"https://www.newyorker.com/crossword/puzzles-dept/2018/04/30\">The New Yorker just launched a crossword puzzle</a>.</p>\n\n<blockquote>\n  <p>Most of our readers have e-mail addresses now, and the Web has given us the space to try new things—and to try old things again. In that spirit, we’re launching another crossword, online this time, and in the American style. It’ll be weekly, just like the magazine: a new one every Monday morning</p>\n</blockquote>\n\n<p>I am a daily crossword puzzle player. I enjoy them, though I am not terribly good at them, because I love word games and have read that crosswords help keep your mind sharp into old age.</p>\n\n<p>The New Yorker puzzle is a <em>tiny</em> bit more challenging than I would like (as I said, I’m not a strong player), but I’m happy there’s another source of crossword puzzles (beyond the New York Times, which I also subscribe to) coming my way.</p>\n\n<p>I hope they will someday move it into their iOS app. The scrolling behavior, which affects the on-page keyboard, is annoying on mobile.</p>\n",
			"date_published": "2018-04-30T11:43:23-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/30/introducing-the-new.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/30/prolific-apple-supply.html",
	      	
			"title": "Prolific Apple supply chain analyst Ming-Chi Kuo departs KGI Securities, likely to focus on companies other than Apple",
			
			"content_html": "<p><a href=\"https://9to5mac.com/2018/04/30/prolific-apple-supply-chain-analyst-ming-chi-kuo-departs-kgi/\">Kuo’s departure</a> comes hot off the heels of <a href=\"https://9to5mac.com/2018/04/13/apple-memo-on-leaks-leaks/\">Apple’s recent “leaked” memo</a> about leaking that threatened the leaky leaders who leak.</p>\n\n<blockquote>\n  <p>Why has Ming-Chi Kuo, arguably one of the most popular technology analysts in the world, decided to move on? One possible reason is that his sources have done likewise, or perhaps have even been removed in light of Apple’s recent memo and strong stance against leaks — supply chain or otherwise.</p>\n</blockquote>\n\n<p>I wondered why myself, and figured that Apple has either threatened him, or his sources, with criminal lawsuits. I, for one, wouldn’t mind if Apple finally closed up all the leaks in its supply chain. While these leaks may benefit Apple investors,  they don’t really benefit Apple fans that much.</p>\n",
			"date_published": "2018-04-30T09:49:29-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/30/prolific-apple-supply.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/30/031528.html",
	      	
			"content_html": "<p>Blog post: <a href=\"https://mjdescy.me/2018/04/30/my-slide-into-audiophile-territory-part-3/\">My slide into audiophile territory, Part 3</a></p>\n",
			"date_published": "2018-04-29T23:15:28-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/29/031528.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/30/om-maliks-shinola.html",
	      	
			"title": "Om Malik's Shinola Canfield headphone review",
			
			"content_html": "<p>Om Malik wrote <a href=\"https://om.co/2018/04/29/shinolas-canfield-headphones/\">a thoughtful review</a> of a rather high end headphone, the Shinola Canfield. He includes his philosophy on what makes good headphones, and states that you can find really good headphones between $200 and $500, which I wholeheartedly agree with. I especially enjoyed learning about which headphones he keeps around:</p>\n\n<blockquote>\n  <ol>\n    <li>\n      <p>At home, I listen to Focal Clear, probably the best and the most expensive headphones I will ever owned. I have no desire to either upgrade or change these phones. […]</p>\n    </li>\n    <li>\n      <p>For conference calls and phone conversations, I use Apple AirPods. They aren’t my choice for music, but for watching videos on my iPad, they are more than adequate.</p>\n    </li>\n    <li>\n      <p>For long-haul flights, I have a pair of beat-up Bose headphones that take AA batteries and are as low-tech as Bose can get. They sit in my luggage and will be there until Bose stops making the replacement ear pads. They are not great for music, but on a loud aircraft, they are just a way to mute everything.</p>\n    </li>\n  </ol>\n</blockquote>\n\n<p>I love knowing that he and I have a similar lineup of headphones, and we split our time between them similarly: a top end headphone (except my top end are the Oppo PM-3, which cost a <em>lot</em> less than his Focal Clear); Apple AirPods for phone calls (I use them for calls, podcasts, and TV but almost never for music); and super old, now-crummy Bose for use on airplanes only.</p>\n",
			"date_published": "2018-04-29T20:53:33-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/29/om-maliks-shinola.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/29/i-started-using.html",
	      	
			"content_html": "<p>I started using the Activity Digital face today. I never liked it before, but I’m trying to exercise more and it has been useful.</p>\n\n<p><img src=\"http://mjdescy.micro.blog/uploads/2018/99a8238f7f.jpg\" width=\"312\" height=\"313\" /></p>\n",
			"date_published": "2018-04-28T23:44:27-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/28/i-started-using.html"
		},
		
		{
			"id": "http://mjdescy.micro.blog/2018/04/28/030506.html",
	      	
			"content_html": "<p>Blog post: <a href=\"https://mjdescy.me/2018/04/28/swiftodo-development-notes-april-2018/\">SwiftoDo Development Notes, April 2018</a></p>\n",
			"date_published": "2018-04-27T23:05:06-04:00",
			"url": "https://mjdescy.micro.blog/2018/04/27/030506.html"
		}
		
	]
}
